package ru.itsjava.exercises.collection.lists.immutablelists;

import java.util.*;

public class ImmutableListsPractice {

    public static void main(String[] args) {
//Создать пустой список с помощью метода emptyList()
//Проверить можно ли добавить туда элемент?
//Создать список с помощью метода singletonList()
//Проверить можно ли добавить туда элемент?
//Создать копию списка с помощью метода copyOf()
//Проверить можно ли добавить туда элемент?
//Создать копию списка с помощью метода unmodifiableList()
//Проверить можно ли добавить туда элемент?
//Проверить можно ли добавить в исходный список элемент?
//Создать копию списка с помощью метода nCopies()
//Проверить можно ли добавить туда элемент?

    }
}
